$(document).ready(function() {
    $("#3").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り", "軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻","鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子","練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 3; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
    $(document).ready(function() {
    $("#5").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り", "軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻","鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子","練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 5; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
    $(document).ready(function() {
    $("#10").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り", "軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻","鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子","練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 10; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
    $(document).ready(function() {
    $("#nigiri_3").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り"];
      var selectedValues = [];
      for (var i = 0; i < 3; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
     alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#nigiri_5").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り"];
      var selectedValues = [];
      for (var i = 0; i < 5; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#nigiri_10").click(function() {
      var values = ["サーモン", "オニオンサーモン", "焼とろサーモン", "おろし焼とろサーモン", "ジャンボとろサーモン","サーモンちーず","炙りサーモンバジルチーズ", "活〆寒ぶり", "活〆匠の漬け寒ぶり","えんがわ","焼き鱈", "〆真さば", "〆真さば（ごまネギ）","塩〆いわし（ネギ・生姜）","塩〆いわし", "えび", "えびチーズ","えびバジルチーズ","えびアボカド", "タルタルえびアボカド", "甘えび","えび天にぎり","上えび天にぎり", "蒸しほっき貝", "煮あなご","たまご","牛塩カルビ", "生ハム", "特ネタ中トロ","びんとろ","生サーモン", "サーモンバジルモッツァレラ", "活〆ぶりとろ","活〆匠の漬けぶりとろ","活〆炙りぶりしゃぶ", "活〆真鯛", "漬けごま活〆真鯛","大えび","ほたて貝柱", "大つぶ貝", "大赤貝","うなぎの蒲焼き","生ハムバジルモッツァレラ", "紅鮭の塩筋子包", "サーモン3貫盛り","肉3貫盛り","特ネタ大とろ", "特ネタ大とろ焦がし醤油", "大切りあわび2貫","まぐろ3貫盛り","鮮魚3貫盛り"];
      var selectedValues = [];
      for (var i = 0; i < 10; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#gunkan_3").click(function() {
      var values = ["軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻"];
      var selectedValues = [];
      for (var i = 0; i < 3; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
     alert(selectedValues.join("\n"));
    });
  });
        $(document).ready(function() {
    $("#gunkan_5").click(function() {
      var values = ["軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻"];
      var selectedValues = [];
      for (var i = 0; i < 5; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
     alert(selectedValues.join("\n"));
    });
  });
        $(document).ready(function() {
    $("#gunkan_10").click(function() {
      var values = ["軍艦ねぎまぐろ", "まぐろ山かけ","まぐろユッケ（卵黄醤油）","かにみそ", "軍艦甘エビ", "とびこ軍艦","ししゃもこ軍艦","たらマヨ", "たらこ", "数の子松前漬け","コーン","ツナサラダ", "シーサラダ", "カニ風サラダ","たまごサラダ","いかオクラめかぶ", "小粒納豆", "きゅうり巻","小粒納豆巻","梅きゅうり巻", "海老フライアボカドロール", "本ずわい蟹軍艦","いくら","たら白子", "あん肝", "鉄火巻"];
      var selectedValues = [];
      for (var i = 0; i < 10; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
    $(document).ready(function() {
    $("#saido_3").click(function() {
      var values = ["鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子"];
      var selectedValues = [];
      for (var i = 0; i < 3; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#saido_5").click(function() {
      var values = ["鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子"];
      var selectedValues = [];
      for (var i = 0; i < 5; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#saido_10").click(function() {
      var values = ["鯛だし塩ラーメン","わかめうどん", "きつねうどん", "かけうどん","魚のアラの赤だし","あさりの赤だし", "あおさと海苔の赤だし", "はまぐりの味噌汁","あおさと海苔の味噌汁","季節の茶碗蒸し", "季節のあんかけ茶碗蒸し", "フライドチキン","フライドポテト","まるごと海老の柚子こしょう天ぷら", "ポテサラ", "だし巻き玉子"];
      var selectedValues = [];
      for (var i = 0; i < 10; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
    $(document).ready(function() {
    $("#dezato_3").click(function() {
      var values = ["練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 3; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#dezato_5").click(function() {
      var values = ["練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 5; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });
      $(document).ready(function() {
    $("#dezato_10").click(function() {
      var values = ["練乳いちごパフェ","北海道ミルククレープメルバ", "カタラーナアイスブリュレ", "フォンダンショコラバニラアイス添え","フォンダンショコラ","ショコラケーキリッチ", "北海道ミルククレープ", "クラシックプリン","大学いも","わらびもち", "フローズンマンゴー", "懐かしノメロンシャーベット","北海道バニラアイス"];
      var selectedValues = [];
      for (var i = 0; i < 10; i++) {
        var randomIndex = Math.floor(Math.random() * values.length);
        selectedValues.push(values[randomIndex]);
        values.splice(randomIndex, 1);
      }
      alert(selectedValues.join("\n"));
    });
  });